#### BuiltInFailures.PropertySetElementFailures Members

---

|  |
| --- |
| BuiltInFailures PropertySetElementFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures PropertySetElementFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | EmptyPropertySetName | A property set name cannot be an empty string. |
| Public property Static member | NonStringParameterValue | The given parameter requires a string value. |
| Public property Static member | NonUniquePropertySetName | The value of the given parameter is already in use as a property set name. |

# See Also

BuiltInFailures PropertySetElementFailures Class

Autodesk.Revit.DB Namespace